app/controllers/mountains_controller.rb

  def create
    Mountain.create(params[:mountain])
---
INSERT INTO "mountains" ("country", "created_at", "height", "image", "name", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

def show
  @mountain = Mountain.find(params[:id])
---
SELECT "mountains".* FROM "mountains" WHERE "mountains"."id" = $1 LIMIT 1  [["id", "1"]]

def destroy
  mountain = Mountain.find(params[:id])
  mountain.delete
---
SELECT "mountains".* FROM "mountains" WHERE "mountains"."id" = $1 LIMIT 1  [["id", "7"]]
DELETE FROM "mountains" WHERE "mountains"."id" = 7

def edit
  @mountain = Mountain.find(params[:id])
---
SELECT "mountains".* FROM "mountains" WHERE "mountains"."id" = $1 LIMIT 1  [["id", "3"]]

def update
  mountain = Mountain.find(params[:id])
  mountain.update_attributes(params[:mountain])
---
SELECT "mountains".* FROM "mountains" WHERE "mountains"."id" = $1 LIMIT 1  [["id", "3"]]
UPDATE "mountains" SET "name" = ' Mount Bogongi', "image" = ' http://upload.wikimedia.org/wikipedia/commons/thumb/e/ec/Mt_Bogong%2C_Vic%2C_jjron%2C_09.05.2013.jpg/280px-Mt_Bogong%2C_Vic%2C_jjron%2C_09.05.2013.jpg', "country" = ' Australia', "updated_at" = '2013-07-02 14:24:19.990005' WHERE "mountains"."id" = 3